# Merge: 
These are methods for combining and comparing Series or DataFrame objects.

## 1. Concat

Concatenating merges multiple Series or DataFrame objects along a shared index or column.

### Concatenating Along Rows (Stacking on Top)

Two lists of students from different classes, and you want to combine them into one big list.

In [13]:
import pandas as pd

data1 = pd.DataFrame({
    'Name': ['Eric', 'Ivy'],
    'Age': [40, 37]
})

data2 = pd.DataFrame({
    'Name': ['Jane', 'Jude'],
    'Age': [10, 7]
})

# Concatenate along rows
concat_rows = pd.concat([data1, data2], axis=0)
concat_rows

   Name  Age
0  Eric   40
1   Ivy   37
0  Jane   10
1  Jude    7

### Concatenating Along Columns (Placing Side by Side)

List of student names and another list of their grades, and you want to combine them side by side.

In [14]:
names_df = pd.DataFrame({
    'Name': ['Eric', 'Ivy', 'Jane', 'Jude']
})

age_df = pd.DataFrame({
    'Age': [40, 37, 10, 7]
})

concat_columns = pd.concat([names_df, age_df], axis=1)
concat_columns

   Name  Age
0  Eric   40
1   Ivy   37
2  Jane   10
3  Jude    7

## 2. Join

The join function in pandas is used to combine two DataFrames based on their indexes or a common column. It is particularly useful for merging DataFrames with different columns but the same index or key.

### Joining on Index

Imagine you have two DataFrames: one with student names and ages, and another with their grades. You want to combine these DataFrames based on their indexes.

In [15]:
students1 = pd.DataFrame({
    'Name': ['Eric', 'Ivy'],
    'Age': [40, 37]
}, index=[1, 2])

grades1 = pd.DataFrame({
    'Grade': [97, 92]
}, index=[1, 2])

joined_index = students1.join(grades1)
joined_index

   Name  Age  Grade
1  Eric   40     97
2   Ivy   37     92

### Joining on a Common Column

Imagine you have two DataFrames: one with student names and ages, and another with student names and their grades. You want to combine these DataFrames based on the student names.

In [16]:
students2 = pd.DataFrame({
    'Name': ['Eric', 'Ivy'],
    'Age': [40, 37]
})

grades2 = pd.DataFrame({
    'Name': ['Eric', 'Ivy'],
    'Grade': [97, 92]
})

joined_column = students2.set_index('Name').join(grades2.set_index('Name'))
joined_column

      Age  Grade
Name
Eric   40     97
Ivy    37     92

## Types of Joins

- **Left Join**: Keeps all rows from the left DataFrame, and matches rows from the right DataFrame.
- **Right Join**: Keeps all rows from the right DataFrame, and matches rows from the left DataFrame.
- **Inner Join**: Keeps only the rows that have matching keys in both DataFrames.
- **Outer Join**: Keeps all rows from both DataFrames, filling in missing values with NaNs where there are no matches.

### Example: Different Types of Joins

In [17]:
students3 = pd.DataFrame({
    'Name': ['Eric', 'Ivy', 'Jude'],
    'Age': [40, 37, 10]
})

grades3 = pd.DataFrame({
    'Name': ['Jude', 'Jane'],
    'Grade': [97, 92]
})

### Left Join:

In [18]:
left_join = students3.set_index('Name').join(grades3.set_index('Name'), how='left')
left_join

      Age  Grade
Name
Eric   40    NaN
Ivy    37    NaN
Jude   10   97.0

### Right Join:

In [19]:
right_join = students3.set_index('Name').join(grades3.set_index('Name'), how='right')
right_join

       Age  Grade
Name
Jude  10.0     97
Jane   NaN     92

### Inner Join:

In [20]:
inner_join = students3.set_index('Name').join(grades3.set_index('Name'), how='inner')
inner_join

      Age  Grade
Name
Jude   10     97

### Outer Join:

In [21]:
outer_join = students3.set_index('Name').join(grades3.set_index('Name'), how='outer')
outer_join

       Age  Grade
Name
Eric  40.0    NaN
Ivy   37.0    NaN
Jane   NaN   92.0
Jude  10.0   97.0